#concatenation of strings ត្រូវបានធ្វើឡើងដោយប្រើសញ្ញា + នៅក្នុង Python
frist = "Hello"
second = "World"
# result = frist+second
result = frist + " " + second
print(result)

#slicing of strings ត្រូវបានធ្វើឡើងដោយប្រើសញ្ញា [start:end] នៅក្នុង Python
text = "Python is a programming language"
print(text[0:6])
print(text[-12:])

#fromatting of strings ត្រូវបានធ្វើឡើងដោយប្រើសញ្ញា f នៅក្នុង Python
name = "Alice"
age = 30
formatted_string = f"My name is {name} and I am {age} years old."
print(formatted_string)

#split() method ត្រូវបានប្រើដើម្បីបំបែកស្ទ្រីងទៅជាបញ្ជីដោយផ្អែកលើឃ្លា delimiter ដែលបានផ្តល់
setece = "Hello, how are you?"
word = setece.split(" ")
print(word)

#join() method ត្រូវបានប្រើដើម្បីភ្ជាប់ធាតុក្នុងបញ្ជីទៅជាស្ទ្រីងមួយដោយប្រើឃ្លា delimiter ដែលបានផ្តល់
words = ['Hello', 'how', 'are', 'you?']
sentence = " ".join(words)
print(sentence)

#replace() method ត្រូវបានប្រើដើម្បីជំនួសផ្នែកមួយនៃស្ទ្រីងដោយផ្នែកថ្មី

text = "I love YOU "
new_text = text.replace("YOU", "Money , Car, House, Vacation")
print(new_text)


#stip method ត្រូវបានប្រើដើម្បីដកចេញអក្សរដែលមិនចាំបាច់នៅចុងផ្នែកខាងឆ្វេងនិងខាងស្តាំនៃស្ទ្រីង
text = "   Hello, World!   "
stripped_text = text.strip()
print(f"'{stripped_text}'")

#lower() method ត្រូវបានប្រើដើម្បីបម្លែងអក្សរទាំងអស់ក្នុងស្ទ្រីងទៅជាអក្សរតូច
text = "Hello, World!"
lower_text = text.lower()
print(lower_text)


#upper() method ត្រូវបានប្រើដើម្បីបម្លែងអក្សរទាំងអស់ក្នុងស្ទ្រីងទៅជាអក្សរធំ
text = "Hello, World!"
upper_text = text.upper()
print(upper_text)

#find() method ត្រូវបានប្រើដើម្បីស្វែងរកទីតាំងនៃអក្សរឬស្ទ្រីងក្នុងស្ទ្រីងមួយ
text = "Hello, World!"
position = text.find("World")
print(position)  # Output: 7


#length of string ត្រូវបានគណនាដោយប្រើ len() function នៅក្នុង Python
text = "Hello, World!"
length = len(text)
print(length)  # Output: 13
