# try and except គឺជាគន្លងត្រួតពិនិត្យកំហុស (error handling) ដែលអនុញ្ញាតឱ្យអ្នកដំណើរការកូដដែលអាចបង្កើតកំហុសបានដោយមិនធ្វើឱ្យកម្មវិធីរបស់អ្នកបញ្ឈប់ដំណើរការ។
# វាអាចប្រើបានដើម្បីចាប់កំហុសនិងដោះស្រាយវា ឬផ្តល់ព័ត៌មានលម្អិតអំពីកំហុសដែលកើតឡើង។
# FileNotFoundError គឺជាកំហុសមួយដែលកើតឡើងនៅពេលដែលកម្មវិធីព្យាយាមបើកឯកសារដែលមិនមាន។
#PermissioinError គឺជាកំហុសមួយដែលកើតឡើងនៅពេលដែលកម្មវិធីព្យាយាមបើកឯកសារដែលអ្នកប្រើប្រាស់មិនមានសិទ្ធិគ្រប់គ្រង។
#IoError គឺជាកំហុសទូទៅដែលកើតឡើងនៅពេលមានបញ្ហាផ្នែក I/O (Input/Output) ដូចជាការអានឬសរសេរទិន្នន័យ។
try :
    with open('mmm.txt', 'r') as file:
        content = file.read()
        print(content)
except FileNotFoundError as e:
    print(f"Error file not foun: {e}")